posts/2019-03-27-threat-level-heatnight/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Threat Level Heatnight</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Threat Level Heatnight</h1>
</header><p>
In the past I've had a few occasions where I had to create a <a href="http://wixtoolset.org/">WiX</a> installer for a
C# project. But independent of whatever Google search query I tried, I simply
could not figure out how to use <code>heat.exe</code> to auto-generate the content of my
<code>.msi</code> files. Luckily, because of this lovely <a href="https://stackoverflow.com/questions/36756311/include-all-files-in-bin-folder-in-wix-installer">StackOverflow</a>, this time was
different. I'll cite the steps mentioned in this post so that I'll hopefully
never forget them:
</p>

<blockquote>
<p>
Define the Harvestpath for Heat:
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-xml">&lt;PropertyGroup&gt;
  &lt;DefineConstants&gt;HarvestPath=..\Deploy&lt;/DefineConstants&gt;
&lt;/PropertyGroup&gt;
</pre>
</div>

<blockquote>
<p>
Heat will create a .wxs file. So we need to add this file to the compile
ItemGroup:
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-xml">&lt;ItemGroup&gt;
  &lt;Compile Include="Product.wxs" /&gt; &lt;!-- This will be your default one --&gt;
  &lt;Compile Include="HeatGeneratedFileList.wxs" /&gt; &lt;!-- This is the Heat created one --&gt;
&lt;/ItemGroup&gt;
</pre>
</div>

<blockquote>
<p>
Then execute Heat in the BeforeBuild build target:
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-xml">&lt;Target Name="BeforeBuild"&gt;
  &lt;HeatDirectory
      Directory="..\Deploy"
      PreprocessorVariable="var.HarvestPath"
      OutputFile="HeatGeneratedFileList.wxs"
      ComponentGroupName="HeatGenerated"
      DirectoryRefId="INSTALLFOLDER"
      AutogenerateGuids="true"
      ToolPath="$(WixToolPath)"
      SuppressFragments="true"
      SuppressRegistry="true"
      SuppressRootDirectory="true" /&gt;
&lt;/Target&gt;
</pre>
</div>

<blockquote>
<p>
This will generate the HeatGeneratedFileList.wxs every time the WIX installer is
built. The directory ..\Deploy has to be set to the directory of the files to
include. The only thing we have to do to include these files in our installer is
to edit the main .wxs file (like Product.wxs in this example). Heat will create
a ComponentGroup with the given name from above. This component needs to be
referenced in the Feature section of the Product.wxs:
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-xml">&lt;Feature Id="ProductFeature" Title="DiBA Tool" Level="1"&gt;
  &lt;...&gt;
  &lt;ComponentGroupRef Id="HeatGenerated" /&gt;
&lt;/Feature&gt;
</pre>
</div>

<p>
The above steps worked perfectly, but I had to write some additional code so
that I could extract the version information of my "main <code>.exe</code> file" (which is
contained in <code>HeatGeneratedFileList.wxs</code>). Each file in the heat generated list
has an ID, which in my case looked like this:
<code>fil672A180CB079EF052CD394C3B527E0A9</code>. This ID can be used to reference the
version information (e.g. v1.2.3.4) in my <code>Product.wxs</code> file:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;?define ProductVersion=!(bind.FileVersion.fil672A181CB6794D058CDE94C6B527E0F9) ?&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xml">&lt;Product
    Id="*"
    Name="MyApp"
    Language="1033"
    Version="$(var.ProductVersion)"
    Manufacturer="MyCompany"
    UpgradeCode="ffc26465-f32c-4848-acbf-e896c4095236"&gt;
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-03-27</p>
<footer>
<p>Copyright 2025, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
